{
    "atom:link": {
        "href": "http://www.adidas.com/allday/blog/feed/",
        "rel": "self",
        "type": "application/rss+xml"
    },
    "description": "ALL DAY",
    "generator": "https://wordpress.org/?v=4.8.2",
    "items": [
        {
            "category": [
                "Movement",
                "app",
                "intense workouts"
            ],
            "comments": "http://www.adidas.com/allday/blog/take-the-scare-out-of-these-5-intense-workouts/#respond",
            "content:encoded": "<p>Halloween may be full of scares and pranks, but your workouts don&#8217;t have to be. Unmask these five intense workouts and you&#8217;ll see that they&#8217;re all &#8220;Boo!&#8221; but with no bite &#8211; they&#8217;ll give you just the right amount of burn and tone.</p>\n<h1><strong>Parkour</strong></h1>\n<p>If you remember the bad guy Mollaka threading himself through urban obstacles in the 21st James Bond film, Casino Royale—all at top speed, of course—you&#8217;ve already seen a sterling example of Parkour in action. Don&#8217;t worry; beginners aren&#8217;t expected to leap across elevator shafts with Daniel Craig in hot pursuit. Instead, break the seemingly impossible down into safe, easy steps by practicing in a padded indoor Parkour training facility.</p>\n<h1><strong>CrossFit</strong></h1>\n<p><img class=\"alignnone size-full wp-image-58687 lazy\" src=\"https://blog.adidas.com/allday/blog//wp-content/uploads/2017/10/hallowen-2017-box-jump.jpg\" alt=\"\" width=\"1200\" height=\"600\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/hallowen-2017-box-jump.jpg 1200w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/hallowen-2017-box-jump-768x384.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />From the outside, a CrossFit &#8220;box&#8221;—that&#8217;s CrossFit lingo for a gym—can be crazy intimidating. They&#8217;re usually full of burly, scantily clad people shouting at each other as they fling barbells, kettlebells or their own body weight around. But all that shouting is actually encouragement, and most boxes are supportive, all-inclusive environments if you can work up the courage to step in the door. Take away the scare by building your skills, and your confidence, with an introduction to CrossFit class (sometimes billed as &#8220;CrossFit Lite&#8221;) from one of your local CrossFit affiliates.</p>\n<h1><strong>Kettlebells</strong></h1>\n<p>CrossFitters aren&#8217;t the only ones who love kettlebells; flinging these cannonball-shaped weights around builds great functional strength, core stability and cardiovascular fitness. Get used to the idea by taking an intro to kettlebells class at your local gym, hiring a personal trainer for an orientation session or using an instructional video.</p>\n<h1><strong>Kickboxing</strong></h1>\n<p>Slugging an imaginary opponent doesn&#8217;t have to be intimidating—in fact, few things are more gratifying than taping a picture of your ex to the heavy bag and going at it. Get over the initial intimidation by taking a beginner-level course and choosing an instructor you feel comfortable with. If you&#8217;re not thrilled with the first instructor, take the time to try a few more before you give up on the idea of being the next Jean Claude Van Damme.</p>\n<h1><strong>Boot Camps</strong></h1>\n<p>All boot camp workouts give good results, but not all of them are modeled after in-your-face drill sergeants. Visit a few different classes and watch how the instructors work. Do they modify exercises so everybody can participate? Do they build their students up instead of breaking them down? Getting the right instructor will take all the scare out of those boot camps—or really, any workout—and have you killing it with the burpees in no time.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/take-the-scare-out-of-these-5-intense-workouts/\">5 Intense Workouts for Halloween</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "adidas",
            "description": "<p>Halloween may be full of scares and pranks, but your workouts don't have to be.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/take-the-scare-out-of-these-5-intense-workouts/\">5 Intense Workouts for Halloween</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "http://blog.micoach.adidas.com/en/?p=55488"
            },
            "link": "http://www.adidas.com/allday/blog/take-the-scare-out-of-these-5-intense-workouts/",
            "my_id_value": "55488",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/halloween-scare-workouts-2017.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/halloween-scare-workouts-2017-320x200.jpg",
            "pubdate": "Sat, 28 Oct 2017 06:00:18 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "5 Intense Workouts for Halloween",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/take-the-scare-out-of-these-5-intense-workouts/feed/"
        },
        {
            "category": [
                "Movement",
                "app",
                "new york marathon",
                "NYC"
            ],
            "comments": "http://www.adidas.com/allday/blog/first-new-york-marathon-tips/#respond",
            "content:encoded": "<p>The TSC New York City Marathon is the largest in the world, attracting runners from all over the globe. Over 50,000 runners crossed the finish line in <a title=\"New York’s finest\" href=\"http://micoach.adidas.com/en/2014/10/25/new-yorks-finest/\" target=\"_blank\" rel=\"noopener\">2014</a>, and every one of them has a unique story from the experience. Looking forward to writing your own marathon story in New York this year?</p>\n<p>We&#8217;re here to help. Below are some tips on how to take it all in on race day, conquer those pre-race jitters, and still keep your mind set on the finish line.</p>\n<h1><strong>Pre-Race</strong></h1>\n<p>By now you&#8217;ve probably established a pre-run dietary regimen. Practice it on long and vigorous runs that emulate your marathon pace &#8211; and stick to it on race day! Avoid the temptation to indulge too heavily in the many culinary choices available during your visit. There will be plenty of post-race opportunities to dig into the local fare. For now, keep your calories coming from familiar sources.</p>\n<p>&nbsp;</p>\n<p>You&#8217;ll have a lot of walking and standing to do the morning of the race as you&#8217;re move with the crowd toward the start line. Stay rested the day before &#8211; you don&#8217;t want to wear out your legs with a lot of sightseeing before the start gun fires. Trust us, the race itself will deliver all the sights, sounds, and genuine NYC glitz you can handle and then some.</p>\n<p><img class=\"alignnone wp-image-58674 size-full\" title=\"First New York Marathon Training Tips\" src=\"https://blog.adidas.com/allday/blog//wp-content/uploads/2017/10/http___prod.cdata_.app_.sprinklr.com_DAM_271_ULTRABOOST_CHIMARATHON_034-e876d2f8-0d1d-44aa-ab49-e01e7747b0aa-1063942167-2017-10-23-13_05_58.jpg\" alt=\"First New York Marathon Training Tips\" width=\"1200\" height=\"600\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/http___prod.cdata_.app_.sprinklr.com_DAM_271_ULTRABOOST_CHIMARATHON_034-e876d2f8-0d1d-44aa-ab49-e01e7747b0aa-1063942167-2017-10-23-13_05_58.jpg 1200w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/http___prod.cdata_.app_.sprinklr.com_DAM_271_ULTRABOOST_CHIMARATHON_034-e876d2f8-0d1d-44aa-ab49-e01e7747b0aa-1063942167-2017-10-23-13_05_58-768x384.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The race starts in Staten Island. Take the ferry and leave early, but not too early. Two to three hours before start time should give you plenty of time. November in New York tends to be chilly, and you don&#8217;t want to sit or stand around in the cold more than necessary. Layers are your friend &#8211; use clothing you won&#8217;t mind leaving behind as you toss it off along the route.</p>\n<h1><strong>The Race</strong></h1>\n<p>Keep in mind, pacing will be more challenging if for no other reason than the constant roar of the spectators and the adrenaline pumping through your body. Drink in their uplifting support, fuel yourself with it. Just don&#8217;t let it push you into a higher gear than you&#8217;re used to. Stash some of that mojo away for later; you&#8217;ll need it.</p>\n<p>Break the race up mentally into segments and tackle them one at a time. Have some energy bars on hand to re-fuel at least once per hour. Drinks will be available along the route, so don&#8217;t waste energy carrying liquids.</p>\n<h1><strong>Post-Race</strong></h1>\n<p>You made it! You crossed that finish line to unforgettable cheers. Take your medal, you&#8217;ve earned it, and walk a while. Cool down and hydrate. Give your body time to flush out that cramp-inducing lactic acid. Now you can start thinking about all that local cuisine you&#8217;ve run past all day. Enjoy, you&#8217;re a winner! We&#8217;re proud of you!</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/first-new-york-marathon-tips/\">First New York Marathon Training Tips</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "adidas",
            "description": "<p>Running your first New York Marathon? Since you've been logging miles for months toward one goal, let's make sure you're truly ready for the Big Apple race.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/first-new-york-marathon-tips/\">First New York Marathon Training Tips</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "http://blog.micoach.adidas.com/en/?p=55472"
            },
            "link": "http://www.adidas.com/allday/blog/first-new-york-marathon-tips/",
            "my_id_value": "55472",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/nyc-marathnon.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/nyc-marathnon-320x200.jpg",
            "pubdate": "Thu, 26 Oct 2017 06:00:54 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "First New York Marathon Training Tips",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/first-new-york-marathon-tips/feed/"
        },
        {
            "category": [
                "Nutrition",
                "app",
                "cardio nutrition",
                "strength nutrition"
            ],
            "comments": "http://www.adidas.com/allday/blog/what-you-should-eat-for-cardio-vs-strength-workouts/#respond",
            "content:encoded": "<p>The Paleolithic diet, the seven-day color diet, Stone Age Crossfit… modern nutrition and exercise is ripe with comic satire. As ripe as the banana you should have every morning with breakfast, in fact. What’s Stone Age Crossfit anyway –a workout in which you push an ice aged boulder atop a Wooly Mammoth? The next thing you know a bleach-tanned diet book author is going to be advocating a “No Food” diet. No thank you.</p>\n<p>That’s the problem with nutrition and exercise. They have more fads than the fashion industry. If you want an all-around healthy diet for an exercise routine, one that balances nutrients and maximizes workout potential, don’t ask the guy at the gym in the 80&#8217;s half-shirt who’s mixing and matching the ingredients of his protein shake like an alchemist. Keep it simple. Keep it honest. And stay fad free.</p>\n<p>What you should eat for a cardio workout is different from what you should eat for a strength workout. Here, let’s break it down. Satire free.</p>\n<h1><strong>Basic Cardio Workout Nutrition</strong></h1>\n<p>It’s time to carb up.  According to most studies, carbohydrates should constitute 75 to 100% of your pre-workout meal. You need energy to power through an intense cardio workout. You want to be able to toss thunderbolts like Zeus. Carbohydrates are metabolized faster than Usain Bolt runs a 100-meter, so a pre-workout meal should be eaten 30 to 60 minutes before you hit the gym.</p>\n<p>The fuel factor, however, depends on your body. Some people eat a full meal before a cardio workout, and others boost their blood sugar with small snacks. A good, well-balanced cardio workout meal might include chicken, brown rice, spinach, and an apple. On the other hand, small snacks such as smoothies, egg whites, Greek yogurt with fruit, and whole grain cereal with raisins and walnuts will boost your blood sugar levels.</p>\n<h1><strong>Basic Strength Workout Nutrition</strong></h1>\n<p>Protein. That’s the name of the game if you want to fuel a strength-based workout and build lean muscle. Protein helps jumpstart recovery. It’s used by muscles to repair and built lean tissue.</p>\n<p>Eat your pre-workout meal 1 to 2 hours before you hit the gym. The amount of protein you need is determined by your body weight, gender, and the length and intensity of your workout. Good sources of protein include beef, poultry, fish, and dairy. At the same time, don’t skip the carbs. You still need some fast-acting energy. A strength training meal should be 25% protein and 75% carbohydrates.</p>\n<h1><strong>Post Workout and Recovery</strong></h1>\n<p>Don’t forget about recovery. It doesn’t matter if you’re eating for a cardio workout or strength training, post workout meals are important. Whether your musculature is like a sleek Jaguar or ripped like a Pontiac GTO, you have to fuel it with the right stuff.</p>\n<p>Proteins and carbohydrates are needed after any type of workout to replenish and repair the body. Don’t skimp on hydration, either. And reload the electrolytes. Coconut water is a good substitute for sports drinks like Gatorade and Powerade, which contain Willy Wonka amounts of sugar.</p>\n<p>Eat. Workout. Sleep. Repeat. Keep it simple.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/what-you-should-eat-for-cardio-vs-strength-workouts/\">What you should eat for cardio vs. strength workouts</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "adidas",
            "description": "<p>The Paleolithic diet, the seven-day color diet, Stone Age Crossfit… modern nutrition and exercise is ripe with comic satire. As ripe as the banana you should have every morning with breakfast, in fact. What’s Stone Age Crossfit anyway –a workout in which you push an ice aged boulder atop a Wooly Mammoth? The next thing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/what-you-should-eat-for-cardio-vs-strength-workouts/\">What you should eat for cardio vs. strength workouts</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "http://adidas-micoach.prod.humanequation.co/en/"
            },
            "link": "http://www.adidas.com/allday/blog/what-you-should-eat-for-cardio-vs-strength-workouts/",
            "my_id_value": "55773",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/iStock-641382088-1.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/iStock-641382088-1-320x200.jpg",
            "pubdate": "Mon, 23 Oct 2017 06:00:11 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "What you should eat for cardio vs. strength workouts",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/what-you-should-eat-for-cardio-vs-strength-workouts/feed/"
        },
        {
            "category": [
                "Mindset",
                "app",
                "exercise happiness"
            ],
            "comments": "http://www.adidas.com/allday/blog/sweat-your-way-to-happiness/#respond",
            "content:encoded": "<p>We have a challenge for you, next time you feel like your glass is half empty, forget therapy, doctors or pills, exercise is proven to help combat depression. Not convinced? We’ve only just started, read on for more.</p>\n<p>What would make you happy right now? A massage? A raise? How about some push-ups? Well, exercise can lift moods and calm minds. So when you break a sweat, you’ll be fighting the blues too.</p>\n<h1><strong>The Evidence</strong></h1>\n<p>Exercise can make people more cheerful throughout the day, and over time, it can reduce anxiety and depression. Since at least 1981, a whole bunch of medical studies have looked at how exercise affects thoughts, attitudes and even depression. We&#8217;ve been following many of these investigations over the years, and their findings are clear. If you&#8217;re dealing with non-severe depression, your spirits should be higher if you work out routinely. That must be why so many gym instructors never stop smiling (its that or the tight tights)</p>\n<h1><strong>Why Does Working Out Bring Peace and Joy?</strong></h1>\n<p>Despite all the research that&#8217;s been done, medical experts still aren&#8217;t exactly sure why exercise improves moods. Maybe it clears away certain substances that the immune system releases, compounds that aggravate a bad mood. Or, when you work out, some of the chemicals that your brain sends out ― like endorphins ― might make you cheerful.</p>\n<p><img class=\"alignnone wp-image-58647 size-full\" title=\"Sweat your way to happiness\" src=\"https://blog.adidas.com/allday/blog//wp-content/uploads/2016/03/sweat-to-happiness.jpg\" alt=\"Sweat your way to happiness\" width=\"1200\" height=\"600\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2016/03/sweat-to-happiness.jpg 1200w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/03/sweat-to-happiness-768x384.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Putting chemistry aside, exercise gives you many mental advantages that can lead to better moods. For instance, when you&#8217;re sweating, you&#8217;re probably not thinking about financial problems, romantic breakups or other troubling issues. And when you take a break from those pesky negative thoughts, you gain some power over them.</p>\n<p>Plus, after you exercise, you might feel proud of yourself ― and rightly so. A better self-image can lead to more optimism. It can also make you feel ready to tackle big challenges in life. You might even start winking at yourself in the mirror (although we wouldn’t advise this in public). Not to mention, if you work out with friends, you may be laughing and chatting much of the time.</p>\n<p>Enjoying the company of others can ward off the blahs. Exercise can alleviate tension too, which means a better night&#8217;s sleep. More sleep will likely mean a jollier you. There’s really no end to the benefits!</p>\n<h1><strong>A Simple, Cost-effective Remedy</strong></h1>\n<p>You can actually begin feeling those positive vibes after five minutes or so of exercising. And you might find that your sadness or anxiety is suppressed for hours afterwards. But for the best possible outcome, you should complete at least three 30-minute workout sessions per week.</p>\n<p>Remember that courses of treatment have different effects on different people. Thus, don&#8217;t expect that exercising will automatically get rid of your unease or depression, but it could certainly be a step in the right direction. Finally, it&#8217;s fun to share the pleasures of exercising. If you know someone who&#8217;s been feeling stressed or down lately, why not call him or her and suggest a walk or a jog? Afterwards, you&#8217;ll both have something to feel happy about.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/sweat-your-way-to-happiness/\">Sweat your way to happiness</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "adidas",
            "description": "<p>What would make you happy right now? A massage? A raise? How about some push-ups? Well, exercise can lift moods and calm minds. So when you break a sweat, you’ll be fighting the blues too.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/sweat-your-way-to-happiness/\">Sweat your way to happiness</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "http://micoachlowebdev.cloudapp.net/en/?p=55691"
            },
            "link": "http://www.adidas.com/allday/blog/sweat-your-way-to-happiness/",
            "my_id_value": "55691",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2016/03/sweat-happiness-2.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2016/03/sweat-happiness-2-320x200.jpg",
            "pubdate": "Fri, 20 Oct 2017 06:00:53 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "Sweat your way to happiness",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/sweat-your-way-to-happiness/feed/"
        },
        {
            "category": [
                "Movement",
                "app",
                "football",
                "plyometrics"
            ],
            "comments": "http://www.adidas.com/allday/blog/the-quick-guide-to-plyometrics/#respond",
            "content:encoded": "<p>Plyometrics can make a big difference in your body. They’re a great way to boost strength, increase power, and change up your routine (they could be your key to a faster sprint time or a higher jump). They&#8217;re especially useful for sports like football which require you to accelerate and decelerate quickly and explosively change direction. Plyometric movements are movements that involve jumping or bounding — up and down, side to side, twisting back and forth.</p>\n<p>Walking and running are essentially plyometrics because they involve a bound. Running a mile is equal to 1,500 plyometric reps at two to five times your body weight. So it’s not a surprise that recreational runners often suffer from ankle, knee, and hip pain.</p>\n<p>The key is to make sure that these dynamic movements are done safely and balanced within a well-designed workout. If they’re not, you could find yourself on the injured list. Here’s how to reap the benefits and stay in playing shape.</p>\n<h1><img class=\"alignnone wp-image-58638 size-full\" title=\"The quick guide to plyometrics\" src=\"https://blog.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-2.jpg\" alt=\"The quick guide to plyometrics\" width=\"1200\" height=\"800\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-2.jpg 1200w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-2-768x512.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-2-900x600.jpg 900w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /></h1>\n<h1>The Benefits of Plyometrics</h1>\n<p>Plyometrics activate your central nervous system, which helps stimulate your body’s fast-twitch muscle fibers to generate force quickly and effectively. Plyometrics aren’t just leg exercises, you can also do upper body plyometrics.</p>\n<p>Deceleration is just as important as acceleration. A lot of injuries are the result of not being able to slow down fast enough. The elasticity you develop doing plyometrics can help you slam on the breaks.</p>\n<h1>How to Safely Perform Plyometrics</h1>\n<p><img class=\"alignnone wp-image-58636 size-full\" title=\"The quick guide to plyometrics\" src=\"https://blog.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-3.jpg\" alt=\"The quick guide to plyometrics\" width=\"1200\" height=\"1200\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-3.jpg 1200w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-3-600x600.jpg 600w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-3-768x768.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-3-62x62.jpg 62w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-3-183x183.jpg 183w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-3-355x355.jpg 355w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-3-239x239.jpg 239w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />While plyometric exercises are effective, there’s a risk of injury if they’re done improperly or without the proper supervision. Poor execution can lead to shin splints, knee and ankle injuries, and lower back problems. Here are a few tips to reduce your risk of injury while doing plyometrics.</p>\n<ol>\n<li>\n<ol>\n<li>Build a strong strength and conditioning base before adding plyometrics to your routine.</li>\n<li>If you weigh more than 200 pounds, you’re more at risk of injury and should avoid high-volume, high-intensity plyometrics.</li>\n<li>Kick-start your workout with a warm-up (walk-jog-stride-sprint cycles for one-half to three-quarters of a mile), dynamic stretching, and Movement Prep to ease into your workout.</li>\n<li>Wear shoes that support your arch and ankle. Look for a wide, non-slip sole. Don’t wear running shoes.</li>\n<li>Perform your plyometric workout on a shock-absorbing surface, such as grassy areas, well-padded artificial turf, and wrestling mats.</li>\n<li>Choose a sturdy, non-slip plyometric box.</li>\n<li>The average recommended heights for depth jumps are .75 to .80 meters for athletes less than 220 pounds. The height for those weighing more than 220 is .5 to .75 meters. (One meter is equal to 39.37 inches.)</li>\n<li>Stick with two or three 20-minute sessions each week.</li>\n</ol>\n</li>\n</ol>\n<h1>The Keys to Post-Injury Plyometrics</h1>\n<p>Getting back into the swing of things after an injury is exciting, but taking things too fast can put you right back on the bench. So where do you start? Once you can squat without pain, you’re ready to work plyometrics back into your routine.</p>\n<p>Start slow and focus on absorption. Work on standing tall, squatting, and stabilizing both with two feet and one foot. Once you’ve mastered that movement, jump up on a short box or step. Work on the same eccentric absorption with this movement. You can also start by stepping off of one foot, absorbing, and balancing on the other. Just like walking.</p>\n<p>As you rebuild your confidence, strength, and stability, increase your distance and amplitude. Use a measuring stick or different sized boxes or hurdles to challenge yourself. As you increase amplitude, keep volume steady. You don’t want to increase them both at the same time. Stick with two to three sets of four to eight reps, especially as you&#8217;re focusing on building up tissue tolerance. This is a great progression for patients rehabbing injuries and also food for athletes who are new to plyometrics or who haven’t done them recently.</p>\n<p>Use this set and rep pattern two to three times a week and rest at least a day between each session.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/the-quick-guide-to-plyometrics/\">The quick guide to plyometrics</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "adidas",
            "description": "<p>Plyometrics can make a big difference in your body. They’re a great way to boost strength, increase power, and change up your routine. Here’s how to reap the benefits and stay in playing shape.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/the-quick-guide-to-plyometrics/\">The quick guide to plyometrics</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "http://blog.micoach.adidas.com/en/?p=55134"
            },
            "link": "http://www.adidas.com/allday/blog/the-quick-guide-to-plyometrics/",
            "my_id_value": "55134",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-1.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/plyometrics-1-320x200.jpg",
            "pubdate": "Mon, 16 Oct 2017 06:00:21 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "The quick guide to plyometrics",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/the-quick-guide-to-plyometrics/feed/"
        },
        {
            "category": "Nutrition",
            "comments": "http://www.adidas.com/allday/blog/how-to-stoke-your-metabolism/#respond",
            "content:encoded": "<p>Burn, baby, burn! Your metabolism is your body’s fat-burning engine. It helps you build lean muscle mass, burn fat, and stay energized. While your metabolism is partially impacted by gender and genetics, there is also a lot you can do to get your metabolic fire blazing. Use the strategies below to burn more calories, boost energy, and look and perform better.</p>\n<h1>Focus on Food</h1>\n<p>Your diet is one of the most effective ways that you can get your metabolism going. Start your day off with a healthy breakfast. It really is the most important meal of the day. When you wake up, your body is running in low gear so you’re burning fewer calories. Eating a healthy breakfast cranks your metabolism into high gear so you can start your day off right.</p>\n<p>Choose a blend of carbohydrates, protein, and healthy fat. While all of these macro-nutrients are important, it’s protein that really gets your metabolism up and running. When choosing protein, aim for foods with fewer legs like fish, turkey, or chicken. You can also get protein from lean cuts of red meats – be picky – and low-fat or nonfat dairy.</p>\n<p>Research has shown that people who eat protein with their breakfast tend to maintain a leaner body composition. Great choices: whole-wheat toast with eggs scrambled with veggies or a smoothie blended with frozen fruit, Greek yogurt or protein powder, and flaxseed.</p>\n<p>Once you’ve enjoyed breakfast, keep the momentum going by eating every two to three hours. Why? Every time you eat your body has to rev up your metabolism to break down food. This is known as the “thermic effect.” Aim for five to six small meals throughout the day with the same combo of carbs, protein, healthy fat, and color from veggies and fruit.</p>\n<p>Wash your meals down with plenty of water, and strive to drink at least half your body weight in ounces of water each day. If you want something with a little flavor, opt for green tea (the tea bag kind, not the bottled version). It’s loaded with catechins that help stimulate your body to burn calories. Research has shown that just four cups a day can help optimize body composition.</p>\n<h1>Optimize Your Workouts</h1>\n<p>The way you work out has a big impact on how well your metabolism works. Interval training is an extremely effective way to get a solid workout and burn more calories both during and after exercise. With interval training, you’ll work hard for short periods of time and then allow your body to fully recover. This keeps your metabolism working even after you finish your workout. Try this with both cardio and strength and flexibility workouts. It’ll help boost your metabolism and improve your cardiovascular fitness allowing you to push yourself harder with each workout. Get after it and feel the results!</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/how-to-stoke-your-metabolism/\">How to stoke your metabolism</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "adidas",
            "description": "<p>While your metabolism is partially impacted by gender and genetics, there is also a lot you can do to get your metabolic fire blazing.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/how-to-stoke-your-metabolism/\">How to stoke your metabolism</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "http://micoach.adidas.com/en/?p=44138"
            },
            "link": "http://www.adidas.com/allday/blog/how-to-stoke-your-metabolism/",
            "my_id_value": "44138",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2015/02/Metabolism.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2015/02/Metabolism-320x200.jpg",
            "pubdate": "Fri, 13 Oct 2017 06:00:17 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "How to stoke your metabolism",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/how-to-stoke-your-metabolism/feed/"
        },
        {
            "category": [
                "Movement",
                "app",
                "London",
                "marathon training",
                "NYC"
            ],
            "comments": "http://www.adidas.com/allday/blog/everything-you-need-to-know-about-marathon-training/#respond",
            "content:encoded": "<p>If your Instagram feed has been blowing up lately with pictures of your friends crossing marathon finish lines and holding up their shiny medals, you&#8217;re not alone. Fall is prime running season &#8211; the weather is *perfect* and there are races galore to be run. You probably know someone who&#8217;s has run or is running Chicago, New York City, Berlin, or any number of the other famous fall marathons. And though it&#8217;s too late to sign up and train for one of those, you can certainly let them inspire you to sign up for a spring marathon.</p>\n<p>If you&#8217;re already relatively fit, you should allot 16 to 20 weeks to get trained for a marathon, meaning if you are eyeing London on April 22, 2018, you need to start training somewhere between early December and the first of the new year. If you&#8217;ve let your fitness routine fall by the wayside a bit, no worries &#8211; just factor in an extra three to four weeks to get yourself up to speed &#8211; literally. Here&#8217;s everything you need to know about marathon training so you can finish strong, no matter when and where you run 26.2 miles.</p>\n<h2>Step 1: Customize your training plan</h2>\n<p><a href=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/marathon-training-4.jpg\" target=\"_blank\" rel=\"noopener\"><img class=\"aligncenter wp-image-56389 size-full\" title=\"Everything You Need to Know about Marathon Training\" src=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/marathon-training-4.jpg\" alt=\"Everything You Need to Know about Marathon Training\" width=\"1440\" height=\"960\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-4.jpg 1440w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-4-768x512.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-4-900x600.jpg 900w\" sizes=\"(max-width: 1440px) 100vw, 1440px\" /></a></p>\n<p>You know what they say about failing to plan… that same idea applies to marathon training. But you can&#8217;t just Google &#8220;marathon training plans&#8221; and choose the first search result you find.</p>\n<p>&#8220;Training plans aren&#8217;t one-size-fits-all,&#8221; says Kerry Greer, an expert with EXOS. Consider your fitness level but also your goal (do you want to run the marathon in under four hours? Five? Three?) How many days per week to do you want to work out? On what day do you want to do your long run?</p>\n<h2>Step 2: Add strength and flexibility training</h2>\n<p><a href=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/marathon-training-1.jpg\" target=\"_blank\" rel=\"noopener\"><img class=\"aligncenter wp-image-56386 size-full\" title=\"Everything You Need to Know about Marathon Training\" src=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/marathon-training-1.jpg\" alt=\"Everything You Need to Know about Marathon Training\" width=\"1440\" height=\"960\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-1.jpg 1440w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-1-768x512.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-1-900x600.jpg 900w\" sizes=\"(max-width: 1440px) 100vw, 1440px\" /></a></p>\n<p>&#8220;Balancing your running with strength training gives your body the stability and power to increase your running efficiency,&#8221; says Greer. In other words: Getting to the gym will help you to be a better runner. Get in the gym two to three days a week, per Greer.</p>\n<h2>Step 3: Focus on technique</h2>\n<p><a href=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/marathon-training-3.jpg\" target=\"_blank\" rel=\"noopener\"><img class=\"aligncenter wp-image-56388 size-full\" title=\"Everything You Need to Know about Marathon Training\" src=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/marathon-training-3.jpg\" alt=\"Everything You Need to Know about Marathon Training\" width=\"1440\" height=\"960\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-3.jpg 1440w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-3-768x512.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-3-900x600.jpg 900w\" sizes=\"(max-width: 1440px) 100vw, 1440px\" /></a></p>\n<p>Ok, so now you&#8217;ve got your workouts scheduled and you&#8217;re ready to actually get out there and run. Great. Just be sure you&#8217;re running right! &#8220;Posture and technique are keys to putting your mind and body in the best position to perform,&#8221; says Greer. &#8220;Good posture &#8211; run tall with your chest up, shoulders back, and feet under your hips &#8211; helps your body to work as one unit in proper alignment, warding off injury and helping you to maximize efficiency.&#8221;</p>\n<h2>Step 4: Stay hydrated</h2>\n<p>Here&#8217;s an easy one: Drink some H2O OK? You can find plenty of fuel belts and handheld water bottles so you can bring it along with you on runs lasting more than hour. It may be the simplest way to ensure you run your best since being as little as two percent dehydrated can decrease your mental and physical performance by a whopping 20 percent (!) per Greer. (And for those of you looking to lose weight through marathon training, hear this: Staying hydrated gives your metabolism a boost, to boot!)</p>\n<blockquote><p>&#8220;On a regular day, try to drink ½ an ounce of water for every pound of body weight,&#8221; says Greer. During long runs, stay hydrated by drinking at regular intervals. Though it&#8217;s different for everyone, some runners need to drink 8-12 ounces of water, sports drink, or electrolyte beverage every 20 minutes to minimize the effects of dehydration, says Laura Kunces, a nutrition expert with EXOS. More importantly, monitor your thirst throughout the run and continue to drink regularly even as the temps continue to drop and you may not feel as thirsty.</p></blockquote>\n<h2>Step 5: Remember to rest.</h2>\n<p><a href=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/maraton-training-6.jpg\" target=\"_blank\" rel=\"noopener\"><img class=\"aligncenter wp-image-56393 size-full\" title=\"Everything You Need to Know about Marathon Training\" src=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/maraton-training-6.jpg\" alt=\"Everything You Need to Know about Marathon Training\" width=\"1440\" height=\"1000\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/maraton-training-6.jpg 1440w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/maraton-training-6-768x533.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/maraton-training-6-864x600.jpg 864w\" sizes=\"(max-width: 1440px) 100vw, 1440px\" /></a></p>\n<p>This one may sound easy, but beware: It&#8217;s deceptive. Once you get into your training you may find yourself skimping on sleep in order to get in a run. Or, you may be tempted to do two back-to-back tough workouts to get &#8217;em out of the way ahead of that weekend road trip to take in the fall foliage, pick apples-you know, the stuff autumn was made for!</p>\n<p>It&#8217;s tough to manage training with a day job and (gasp!) having a life outside of both, but it&#8217;s all about finding balance and that includes rest days. &#8220;<a href=\"https://blog.adidas.com/allday/blog/why-you-need-to-foam-roll/\" target=\"_blank\" rel=\"noopener\">Recovery and regeneration</a> activities should be built into your daily routine to help prevent injury and keep you on your training plan,&#8221; says Greer. Once a week, do a low intensity activity like a bike ride or &#8211; better yet &#8211; build an &#8220;easy&#8221; hike into your weekend getaway. On another day each week, try foam rolling, massage, yoga, or stretching in place of a work out.</p>\n<h2>Step 6: Taper your training.</h2>\n<p>Ok, so you&#8217;ve been training for about 13 weeks now and you&#8217;ve hit the golden 20-mile run on your plan. Congrats! That&#8217;s huge. Now it&#8217;s time to &#8220;taper.&#8221; &#8220;About two to three weeks before the marathon, steadily decrease how many miles you&#8217;re running and the intensity of your training,&#8221; says Greer. &#8220;This allows your body to adapt, recover, and fully benefit from your training.&#8221;</p>\n<p>Just be aware that many runners end up with what&#8217;s been called &#8220;the taper tantrums&#8221; where you feel like you should be doing more than you are and you&#8217;re a bit cranky and may even feel more sore or tired physically. Know that it&#8217;s normal and resist the urge to run more than the training plan suggests!</p>\n<h2>Step 7: Warm up on race day.</h2>\n<p><a href=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/marathon-training-5.jpg\" target=\"_blank\" rel=\"noopener\"><img class=\"aligncenter wp-image-56390 size-full\" title=\"Everything You Need to Know about Marathon Training\" src=\"http://blog.adidas.com/allday/blog/wp-content/uploads/2016/10/marathon-training-5.jpg\" alt=\"Everything You Need to Know about Marathon Training\" width=\"1440\" height=\"987\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-5.jpg 1440w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-5-768x526.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-5-875x600.jpg 875w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-5-511x350.jpg 511w, http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/marathon-training-5-255x174.jpg 255w\" sizes=\"(max-width: 1440px) 100vw, 1440px\" /></a></p>\n<p>&#8220;A good warm up is just as important before a race as it is before a training session,&#8221; says Greer. As we explained in our quick and effective warmups <a href=\"https://blog.adidas.com/allday/blog/quick-and-effective-warmups-2/\" target=\"_blank\" rel=\"noopener\">blog</a>, it helps to increase your core temperature, activate your prime running muscles (hello, quads, hammies, calves, and glutes!), and even gets your mind-body connection humming more efficiently. Choose four to six movements to perform at the starting line.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/everything-you-need-to-know-about-marathon-training/\">Everything You Need to Know about Marathon Training</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "Caitlin Carlson",
            "description": "<p>Get inspired to run your first marathon - and find out everything you need to know before you sign up. Here's how to get a customized training plan, build in cross training - and run your best on race day.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/everything-you-need-to-know-about-marathon-training/\">Everything You Need to Know about Marathon Training</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "http://blog.micoach.adidas.com/en/?p=56384"
            },
            "link": "http://www.adidas.com/allday/blog/everything-you-need-to-know-about-marathon-training/",
            "my_id_value": "56384",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/Marathon-Training-1.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2016/10/Marathon-Training-1-320x200.jpg",
            "pubdate": "Tue, 10 Oct 2017 06:00:18 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "Everything You Need to Know about Marathon Training",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/everything-you-need-to-know-about-marathon-training/feed/"
        },
        {
            "category": [
                "Mindset",
                "adaptive rock climbing",
                "app",
                "Philip Kaminski"
            ],
            "comments": "http://www.adidas.com/allday/blog/58581-2/#respond",
            "content:encoded": "<p>Some athletes use creativity as a way to get an edge over their competition. Professional rock climber <a href=\"https://blog.adidas.com/allday/blog/?p=58569&amp;preview=1&amp;_ppp=ab14518491\" target=\"_blank\" rel=\"noopener\">Nina Williams</a> is one example: Since she’s on the shorter side, she says, she must think outside the box when she’s climbing and “create her own path.” Another creative climber is New York City-based Philip Kaminski. After a battle with synovial cacoma cancer, the now 28-year-old lost his right leg. A lifelong athlete, he was understandably down &#8211; before he literally climbed to great heights.</p>\n<blockquote><p>“When I walked in to <a href=\"https://brooklynboulders.com/brooklyn/\" target=\"_blank\" rel=\"noopener\">Brooklyn Boulders</a> for the first time, I met some of the adaptive climbers and volunteers with ACG [Adaptive Climbing Group]. Seeing what they could do made me realize that I could easily do this,” says Kaminski.</p>\n<p>“Even on the first day they were pushing me to not only continue climbing but to work on harder “problems” [the routes that the climbers “solve” by climbing them]. I guess they saw something in me and I ended up seeing that in myself over time.”</p></blockquote>\n<p>Now, the North Carolina-native is setting his sites on a podium finish despite the fact that the adaptive climbing field is constantly growing and getting more competitive. Here, how he’s planning to get there &#8211; and what you can learn from him.</p>\n<h1>Get Creative</h1>\n<h1><img class=\"lazy alignnone wp-image-58587 size-full\" title=\"Creative Tips for Every Athlete\" src=\"https://blog.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-2.jpg\" alt=\"Creative Tips for Every Athlete\" width=\"1200\" height=\"800\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-2.jpg 1200w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-2-768x512.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-2-900x600.jpg 900w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /></h1>\n<blockquote><p>“When I look at problems, I think ‘that’s not what the route-setter had in mind but I’m going to find my way around it and be creative and be adaptive,” says Kaminski. “I’m constantly throwing conventional climbing technique out the window. Obviously it’s important &#8211; so important in many cases &#8211; and sometimes I have to work around it and that’s the literal definition of adaptive climbing.”</p></blockquote>\n<p>But even if you’re not an adaptive climber, thinking about any fitness pursuit in a fresh way can be exactly what you need to get to the next level.</p>\n<h1>Sharpen Your Mind Outside the Gym</h1>\n<p>“Off the wall, I’m constantly writing. I have a journal and notebook that I fill with various things. I love learning new languages,” says Kaminski. “I always try to be active with keeping my mind sharp and reading things that spur and challenge my intellect. I feel that having outlets away from climbing really helps you to stay calm and focused on the wall mentally because my mind’s not racing all over the place.”</p>\n<p>Whether you study Japanese and Spanish like Kaminski or simply add more non-fiction to your life, consider ways you can engage your brain even when you’re not exercising.</p>\n<h1>Talk to “Better” Athletes</h1>\n<p>“I’m always reaching out to members of the climbing community for new ways to challenge myself physically or train. Just yesterday Nina [Williams] gave me some amazing pointers when it comes to working campus boards and training to increase the power in my fingers,” says Kaminski. “She’s been doing it for 15 years and has a wealth of knowledge… plus she’s cool and fun to climb with and that makes a world of difference. It’s really helpful getting advice from people who are better athletes than yourself.”</p>\n<h1>Seek Expert Help</h1>\n<p><img class=\"alignnone wp-image-58585 size-full\" title=\"Creative Tips for Every Athlete\" src=\"https://blog.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-4.jpg\" alt=\"Creative Tips for Every Athlete\" width=\"1200\" height=\"800\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-4.jpg 1200w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-4-768x512.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-4-900x600.jpg 900w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Beyond talking to the experts, Kaminski works with a coach as well.</p>\n<blockquote><p>“I just started with a new strength and conditioning coach at Brooklyn Boulders who was a division one track and field athlete in college so I’m on a pretty strict training and nutrition regimen that’s pushing me to my limits,” he says. “Working with a person who knows how to train at a high level for athletics has made a world of difference.”</p></blockquote>\n<p>The bottom line: Consider tapping your fit friends for advice (and sharing your own!) and even hiring a coach or personal trainer—even temporarily—to really further your knowledge and skills.</p>\n<h1>Accept This Invite</h1>\n<p>“To anyone looking to get into climbing for the first time, I extend an invite,” says Kaminski. “One thing I’ve learned from Brooklyn Boulders is that in addition to the amazing sense of community, it’s also an extremely diverse community. You see people of every race, color, creed, orientation, size, shape, ability, and disability, climbing and laughing and having a good time on the wall regardless of their skill level,” he says, “By all means, come on out. If a guy with one leg can do it, I’m pretty sure you can.”</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/58581-2/\">Creative Tips for Every Athlete</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "Caitlin Carlson",
            "description": "<p>Adaptive climber Philip Kaminski must think outside the box when it comes to tackling rock climbing “problems” and the competition. Here’s some tips every athlete can learn from.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/58581-2/\">Creative Tips for Every Athlete</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "https://blog.adidas.com/allday/blog/?p=58581"
            },
            "link": "http://www.adidas.com/allday/blog/58581-2/",
            "my_id_value": "58581",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-Brooklyn.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Philip-Brooklyn-320x200.jpg",
            "pubdate": "Sat, 07 Oct 2017 06:00:34 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "Creative Tips for Every Athlete",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/58581-2/feed/"
        },
        {
            "category": [
                "Movement",
                "app",
                "nina williams",
                "rock climbing"
            ],
            "comments": "http://www.adidas.com/allday/blog/4-things-every-athlete-can-learn-professional-rock-climber/#respond",
            "content:encoded": "<p>As an athlete, would you rather have raw talent or drive and passion? Though the former may seem like the “correct” answer (there is no “right” answer, btw!) professional rock climber Nina Williams would argue for the latter.</p>\n<div class=\"row\"><div class=\"col-sm-12\"><div class=\"allday-quote allday-module\"><blockquote class=\"allday-quote-container\"><div class=\"allday-h-sm allday-primary-color-text\">\"Growing up, I had talent but I wasn’t the best of the best. I’m certainly not the best of the best now,\"</div><a class=\"allday-call-to-act-button-outer\" href=\"https://twitter.com/home?status=Growing up, I had talent but I wasn’t the best of the best. I’m certainly not the best of the best now, https://goo.gl/HhVQkr\" title=\"Growing up, I had talent but I wasn’t the best of the best. I’m certainly not the best of the best now,\"><i class=\"fa adicon-twitter allday-primary-color-text\"></i></a></blockquote><!-- .allday-quote-container --></div><!-- .allday-quote --></div><!-- .col-sm-12 --></div><!-- .row -->\n<p>But in addition to simply being willing to put in the effort, Williams has another character trait that separates her from any other <a href=\"http://www.adidas.com/Nina_Williams_Climb_the_City\" target=\"_blank\" rel=\"noopener\">talented rock climber</a>: creativity. Here, the 27-year-old Boulder, Colorado-based rock star (literally) shares her secrets to success.</p>\n<p>Take note: these tips and strategies apply far beyond the <a href=\"http://brooklynboulders.com/brooklyn/?prompt-location\" target=\"_blank\" rel=\"noopener\">rock wall</a> and translate to courts, tracks, and gyms alike.</p>\n<h1><img class=\"alignnone wp-image-58575 size-full\" title=\"4 Things Every Athlete Can Learn From a Professional Rock Climber\" src=\"https://blog.adidas.com/allday/blog//wp-content/uploads/2017/10/nina-williams-3.jpg\" alt=\"4 Things Every Athlete Can Learn From a Professional Rock Climber\" width=\"1200\" height=\"800\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/nina-williams-3.jpg 1200w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/nina-williams-3-768x512.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/nina-williams-3-900x600.jpg 900w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /></h1>\n<h1>Create Your Own Path</h1>\n<blockquote><p>“I have to [literally] create my own path sometimes because I am on the shorter side,” says Williams. “A person of average height will go the average way. Being short, I branch out. It really makes me think outside the box.”</p></blockquote>\n<p>This idea can be applied to your whole life &#8211; and any workout. Just because some people do <a href=\"https://www.adidas.com/allday/blog/3-ways-to-make-your-bodyweight-routine-more-effective/\" target=\"_blank\" rel=\"noopener\">bodyweight exercises</a> for 12 reps, why don’t you try eight reps at a slightly heavier weight? That’s just on simple way to keep your body guessing and look for ways to forge your own fit path. “It’s very freeing to think: I actually have the power to create my own individuality and don’t have to go the path of everyone else,” says Williams.</p>\n<h1>Cross-train</h1>\n<p><img class=\"lazy alignnone wp-image-58576 size-full\" title=\"4 Things Every Athlete Can Learn From a Professional Rock Climber\" src=\"https://blog.adidas.com/allday/blog//wp-content/uploads/2017/10/nina-williams-2.jpg\" alt=\"4 Things Every Athlete Can Learn From a Professional Rock Climber\" width=\"1200\" height=\"800\" srcset=\"http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/nina-williams-2.jpg 1200w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/nina-williams-2-768x512.jpg 768w, http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/nina-williams-2-900x600.jpg 900w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Of course, much of Williams’ training happens on the rocks or in the rock climbing gym. But she understands the importance of cross-training for injury prevention, yes, but also for staying strong overall so she can have that edge. Her weightlifting routine includes deadlifts, box jumps, and a little bit of cardio.</p>\n<blockquote><p>“In the past, climbing has overlooked power of the legs and people think it’s all about upper body strength,” she explains. She also focuses on a more surprising body part: her fingers. “<a href=\"https://www.instagram.com/p/BX8iR9tg_T6/?taken-by=sheneenagins\" target=\"_blank\" rel=\"noopener\">Hanging from my finger tips</a> on edges allows my fingers and hands to support my full body weight,” she says, noting how key this is to her sport in particular.</p></blockquote>\n<h1>Eat According to Mood</h1>\n<p>“Priority number one is always coffee,” says Williams of her pre-climbing ritual. The meal, though, depends on her mood.</p>\n<blockquote><p>“Sometimes I make a lot of vegetables and eggs and have a big breakfast to sustain me for the rest of the day; Sometimes I’ll just have some oatmeal or yogurt,” she says.</p></blockquote>\n<p>Mindful eating &#8211; and simply eating with awareness of how full you are, paying attention to cravings, etc &#8211; is one of the keys. Williams also knows that long days on the rocks require additional fuel so she packs well: “I like bringing a jar of peanut butter and bananas, an apple, nuts, and an energy bar.”</p>\n<h1>Listen to Your Body</h1>\n<p>“Recovery is extremely important because if you don’t let your body rest back to 100 percent, then you can’t give 100 percent the next effort,” says Williams.</p>\n<p>“I try to listen to my body whether it’s during my training or climbing when I’m pushing hard or the next day when I’m really sore and I think ‘I better take a little bit of a longer rest, she says. “I push myself as far as I can but I rarely push myself to 100 and 110 percent all the time because that’s when people start get injured. For me climbing has always been about long-term. It’s rarely been about that one immediate result. I want to climb for the rest of my life. I want to climb until I can’t climb a set of stairs anymore. In order to achieve that ultimate goal I have to take care of myself.”</p>\n<p>Check out how to use <a href=\"https://www.adidas.com/allday/blog/go-hot-and-cold-to-recover-faster/\" target=\"_blank\" rel=\"noopener\">hot and cold therapies</a> to recover faster, <a href=\"https://www.adidas.com/allday/blog/sleep-better-tonight/\" target=\"_blank\" rel=\"noopener\">maximize sleep</a>, and <a href=\"https://www.adidas.com/allday/blog/category/rest/\" target=\"_blank\" rel=\"noopener\">more ways</a> to get a level-up via regeneration.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/4-things-every-athlete-can-learn-professional-rock-climber/\">4 Things Every Athlete Can Learn From a Professional Rock Climber</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "Caitlin Carlson",
            "description": "<p>Pro rock climber Nina Williams shares four ways that separate her from the rest of the pack. Any athlete can utilize these creative strategies to take their fitness up a few notches.</p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/4-things-every-athlete-can-learn-professional-rock-climber/\">4 Things Every Athlete Can Learn From a Professional Rock Climber</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "https://blog.adidas.com/allday/blog/?p=58569"
            },
            "link": "http://www.adidas.com/allday/blog/4-things-every-athlete-can-learn-professional-rock-climber/",
            "my_id_value": "58569",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Nina-Williams-1.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/10/Nina-Williams-1-320x200.jpg",
            "pubdate": "Tue, 03 Oct 2017 07:38:32 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "4 Things Every Athlete Can Learn From a Professional Rock Climber",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/4-things-every-athlete-can-learn-professional-rock-climber/feed/"
        },
        {
            "category": [
                "Mindset",
                "all day",
                "app",
                "breathe easy",
                "breathing exercise"
            ],
            "comments": "http://www.adidas.com/allday/blog/discover-the-power-of-your-breath/#respond",
            "content:encoded": "<p>You take around 8 million breaths every year, but when was the last time you thought about it? It&#8217;s probably been awhile since breathing just naturally happens &#8211; no effort required. And that&#8217;s a good thing! You wouldn&#8217;t want to have to remind yourself every few seconds to take in some air. But it is worth turning your focus to your inhales and exhales every now and then. By doing so, you can instantly change your mental and physical well-being &#8211; find out here with the <a href=\"http://www.adidas.com/us/allday\" target=\"_blank\" rel=\"noopener noreferrer\">Breathe Easy</a> discovery in the new adidas All Day App (US only).</p>\n<p><center><iframe src=\"https://www.youtube.com/embed/vCdXe77gtjc?rel=0\" width=\"1280\" height=\"720\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></center></p>\n<p>How is it even possible to go back and forth between controlling your breath and not? It&#8217;s because breathing is the only visceral function that can be both involuntary and voluntary&#8211;that means you can go from automatically doing it to inhaling and exhaling on command. (Compare this to something like your heartbeat, which you can never control.)</p>\n<p>And because your breath is linked to so many other bodily functions, changing it can start a chain reaction. For example, when you&#8217;re stressed, your body reacts by raising your heartbeat, blood pressure, and breathing rate. Force the breath to slow down and you&#8217;ll feel immediately more relaxed, less stressed, and better able to concentrate. Over time, regularly slowing down your breath can even <a href=\"http://onlinelibrary.wiley.com/doi/10.1111/j.1524-6175.2004.03553.x/full\" target=\"_blank\" rel=\"noopener\">lower your blood pressure</a>.</p>\n<h1><strong>HOW TO BREATHE </strong></h1>\n<p>Most people aren&#8217;t breathing fully &#8211; they only expand their chest with each inhale. But if you breathe more deeply and expand your belly and rib cage, you&#8217;ll be able to draw in more air and get the most energy out of the oxygen in it. Your rib cage should expand in every direction &#8211; top to bottom, back to front, and out to the sides.</p>\n<p>Don&#8217;t worry too much about if you breathe in through your nose or mouth &#8211; while inhaling through the nose can increase circulation and blood oxygen levels, inhaling through the mouth forces your jaw to relax. Just see what works best for you! It&#8217;s also important to think about your posture. The way you stand or sit can make it easier or harder to breathe well. When you&#8217;re slumped over, your lungs can&#8217;t expand fully, so keep back straight and shoulders back.</p>\n<h1><strong>GO WITH THE FLOW </strong></h1>\n<p>To use the power of your breath in a positive way, try changing the tempo.</p>\n<ul>\n<li>To calm down: This tempo helps you feel relaxed because the exhale is longer than the inhale. Try this before bedtime or whenever you&#8217;re feeling stressed. Inhale for a count of six, hold for four, then exhale for 10. Repeat for a total of five cycles. Don&#8217;t start out too fast &#8211; you want to imagine breathing in and out through a straw so it slows you down and you don&#8217;t run out of air.</li>\n<li>To boost your energy: Are you hitting that afternoon slump? You can give yourself a caffeine-free jolt of energy by using a more forceful exhale. Inhale for four seconds, then exhale in a super quick burst. Get the air out of your body as fast as you can &#8211; like you&#8217;re blowing dust off a shelf. Do it five times.</li>\n<li>To feel more balanced: Use this one throughout the day as you&#8217;re running errands or working &#8211; it will help you feel more composed and focused. Inhale for four seconds, hold for two, and exhale for six seconds. Do this four times.</li>\n</ul>\n<p>Try these exercises and discover more small ways you can make a big impact on your health by downloading the <a href=\"http://www.adidas.com/us/allday\" target=\"_blank\" rel=\"noopener\">adidas All Day app.</a></p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/discover-the-power-of-your-breath/\">Discover the Power of Your Breath</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "dc:creator": "Alice Oglethorpe",
            "description": "<p>When you're stressed, your body reacts by raising your heartbeat, blood pressure, and breathing rate. Force your breath to slow down and you'll feel immediately more relaxed, less stressed, and better able to concentrate. </p>\n<p>The post <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog/discover-the-power-of-your-breath/\">Discover the Power of Your Breath</a> appeared first on <a rel=\"nofollow\" href=\"http://www.adidas.com/allday/blog\">ALL DAY</a>.</p>\n",
            "guid": {
                "ispermalink": "false",
                "text": "https://blog.adidas.com/allday/blog/?p=58281"
            },
            "link": "http://www.adidas.com/allday/blog/discover-the-power-of-your-breath/",
            "my_id_value": "58281",
            "my_image_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/07/breathe-easy-3.jpg",
            "my_picture_thumbnail_value": "http://www.adidas.com/allday/blog//wp-content/uploads/2017/07/breathe-easy-3-320x200.jpg",
            "pubdate": "Fri, 29 Sep 2017 06:00:44 +0000",
            "slash:comments": "0",
            "text": "\n\n\t\t\t",
            "title": "Discover the Power of Your Breath",
            "wfw:commentrss": "http://www.adidas.com/allday/blog/discover-the-power-of-your-breath/feed/"
        }
    ],
    "language": "en-US",
    "lastbuilddate": "Sat, 28 Oct 2017 06:00:18 +0000",
    "link": "http://www.adidas.com/allday/blog",
    "sy:updatefrequency": "1",
    "sy:updateperiod": "hourly",
    "title": "ALL DAY",
    "type": "rss 2.0"
}
